In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
cast = pd.read_csv("cast.csv")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [8]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [10]:
release_dates = pd.read_csv("release_dates.csv")
release_dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### 1.How many movies are listed in the titles dataframe?

In [14]:
titles.shape[0]

244914

### 2. What are the earliest two films listed in the titles dataframe?

In [24]:
titles.sort_values("year").head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

###  3. How many movies have the title "Hamlet"?

In [33]:
titles[titles.title == "Hamlet"].count()

title    20
year     20
dtype: int64

### 4. How many movies are titled "North by Northwest"?

In [35]:
len(titles[titles.title =="North by Northwest"])

1

### 5. When was the first movie titled "Hamlet" made?

In [199]:
titles[titles.title=="Hamlet"].sort_values("year").T

,52521,198234,39916,10637,101728,172640,161324,67406,122827,133921,82130,192142,178222,62000,189093,173033,202025,154029,88065,6422
title,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet,Hamlet
year,1910,1911,1913,1921,1948,1954,1964,1969,1973,1976,1987,1990,1996,2000,2009,2011,2014,2015,2016,2017

### 6. List all of the "Treasure Island" movies from earliest to most recent.

In [41]:
print(titles[titles.title=="Treasure Island"].sort_values("year"))

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### 7. How many movies were made in the year 1950?

In [197]:
print(len(titles[titles.year==1950]))

1113

### 8. How many movies were made in the year 1960?

In [198]:
len(titles[titles.year==1960])

1549

### 9. How many movies were made from 1950 through 1959?

In [59]:
len(titles[(titles.year>=1950) & (titles.year<=1959)])

12934

### 10. In what years has a movie titled "Batman" been released?

In [60]:
titles[titles.title=="Batman"].

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [61]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [70]:
len(cast[(cast.title == "Inception" ) & (cast.character)])

78

### 12. How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [74]:
c=cast[cast.title == "Inception" ]

In [99]:
c

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3387147,Inception,2010,Ellen Page,actress,Ariadne,3.0
3444628,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3473041,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3480170,Inception,2010,Talulah Riley,actress,Blonde,25.0
3731263,Inception,2010,Shannon Welles,actress,Old Mal,51.0

In [111]:
k = 0
for i in c:
    c.n.isna()
    k=k+1
print(k)

6

### 13. But how many roles in the movie "Inception" did receive an "n" value?

In [114]:
len(c.n)-k

72

### 14. Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [117]:
cast[cast.title=="North by Northwest"].sort_values("n")

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
...,...,...,...,...,...,...
3441077,North by Northwest,1959,Maudie Prickett,actress,Elsie - Maid,NaN
3577128,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3599912,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3739133,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3751311,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

### 15. Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [119]:
cast[(cast.year==1972) & (cast.title=="Sleuth")]

,title,year,name,type,character,n
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0

### 16. Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [143]:
cast[(cast.year==2007) & (cast.title=="Sleuth")].sort_values("n")

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### 17. How many roles were credited in the silent 1921 version of Hamlet?

In [126]:
cast[(cast.title=="Hamlet") & (cast.year==1921)].count()

title        9
year         9
name         9
type         9
character    9
n            9
dtype: int64

### 18. How many roles were credited in Branagh’s 1996 Hamlet?

In [160]:
len(cast[(cast.title=="Hamlet") & (cast.year==1996)])

54

8

### 19.How many "Hamlet" roles have been listed in all film credits through history?

In [135]:
c=cast[cast.title=="Hamlet"]

In [142]:
len(c)

342

### 20.How many people have played an "Ophelia"?

In [144]:
len(cast[cast.title=="Ophelia"])

20

### 21.How many people have played a role called "The Dude"?

In [147]:
len(cast[cast.title=="The Dude"])

0

### 22.How many people have played a role called "The Stranger"?

In [148]:
len(cast[cast.title=="The Stranger"])

106

### 23.How many roles has Sidney Poitier played throughout his career?

In [156]:
len(cast[cast.name=="Sidney Poitier"])

43

### 24.How many roles has Judi Dench played?

In [158]:
len(cast[cast.name=="Judi Dench"])

55

### 25.List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [168]:
k = cast[(cast.name=="Cary Grant") & (cast.n==2)].sort_values("year")

In [170]:
k.tail(2)

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### 26.List the leading roles that Cary Grant played in the 1940s in order by year.

In [177]:
k = cast[(cast.name=="Cary Grant") & (cast.n==1)].sort_values("year")

In [179]:
k[(k.year>1940) & (k.year<1950)]

,title,year,name,type,character,n
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### 27.How many roles were available for actors in the 1950s?

In [182]:
k = cast[(cast.year>1950) & (cast.year<1960)].sort_values("year")

In [188]:
(k.type=="actor").isna().sum()

0

### 28.How many roles were available for actresses in the 1950s?

In [189]:
(k.type=="actresses").isna().sum()

0

### 29.How many leading roles (n=1) were available from the beginning of film history through 1980?

In [190]:
len(cast[(cast.n==1) & (cast.year<1980)].sort_values("year"))

63957

### 30.How many non-leading roles were available through from the beginning of film history through 1980?

In [191]:
len(cast[(cast.n!=1) & (cast.year<1980)].sort_values("year"))

1095378

### 31.How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [194]:
k=cast[(cast.year==1980)].sort_values("year")

In [195]:
k.n.isna().sum()

4466